{
  "HomePage": {
    "title": "Rubén Hernández Acevedo",
    "subtitle": "Desarrollador Full Stack | Apps, Web & IA",
    "description": "Especializado en el desarrollo de aplicaciones móviles, soluciones web modernas y sistemas de inteligencia artificial. Transformo ideas en experiencias digitales innovadoras."
  },
  "Navigation": {
    "home": "Inicio",
    "about": "Acerca",
    "projects": "Proyectos",
    "contact": "Contacto"
  },
  "Language": {
    "switch": "Cambiar idioma",
    "selectLanguage": "Seleccionar idioma",
    "spanish": "Español",
    "english": "Inglés",
    "french": "Francés",
    "portuguese": "Portugués",
    "italian": "Italiano",
    "chinese": "中文"
  },
  "Loader": {
    "loading": "Cargando..."
  },
  "Projects": {
    "title": "Proyectos Realizados",
    "subtitle": "Explora algunos de los proyectos más destacados que he desarrollado, desde aplicaciones web hasta soluciones empresariales.",
    "suncar": {
      "title": "SunCar",
      "description": "Empresa de instalaciones fotovoltaicas. Soluciones innovadoras en energía solar para hogares y empresas."
    },
    "playup": {
      "title": "Playup",
      "description": "Gestión de torneos, jugadores y equipos de fútbol amateur internacional. Plataforma completa deportiva."
    },
    "moneyapp": {
      "title": "MoneyApp",
      "description": "Asistente de finanzas personales con IA. Gestiona tus finanzas de manera inteligente y automatizada."
    },
    "solarsurvivor": {
      "title": "Solar Survivor",
      "description": "Juego de simulación de energía solar. Sobrevive y prospera usando tecnología fotovoltaica sostenible."
    },
    "fintech": {
      "title": "FinTech Platform",
      "description": "Plataforma financiera empresarial con análisis avanzado de datos y dashboard en tiempo real para gestión de carteras."
    }
  },
  "TerminalSection": {
    "title": "Configurando el Entorno",
    "description": "Instalando las habilidades profesionales que hacen la diferencia.",
    "success": "Desarrollador full-stack listo para producción ✨",
    "footer": "El desarrollo de software es como resolver puzzles complejos: cada línea de código cuenta."
  },
  "ResponsiveSection": {
    "title": "Diseño Responsive",
    "description": "Cada proyecto que desarrollo está optimizado para funcionar perfectamente en cualquier dispositivo, desde móviles hasta desktop.",
    "footer": "La experiencia del usuario es consistente sin importar la pantalla desde donde acceda."
  },
  "TabsSection": {
    "title": "Mi Stack Tecnológico Favorito",
    "description": "Si tuviera que elegir un stack tecnológico favorito para desarrollar un proyecto completo, este sería mi arsenal ideal para crear soluciones robustas y escalables.",
    "fastapi": {
      "description": "Framework Python moderno y rápido para crear APIs robustas con documentación automática y validación de tipos."
    },
    "nextjs": {
      "description": "Framework React de producción con renderizado híbrido, optimización automática y experiencia de desarrollo superior."
    },
    "mongodb": {
      "description": "Base de datos NoSQL escalable y flexible que permite manejar grandes volúmenes de datos con esquemas dinámicos."
    },
    "kotlin": {
      "description": "Lenguaje moderno para desarrollo Android nativo con sintaxis concisa y interoperabilidad con Java."
    },
    "swift": {
      "description": "Lenguaje poderoso y intuitivo de Apple para crear aplicaciones iOS nativas de alto rendimiento."
    },
    "railway": {
      "description": "Plataforma de despliegue moderna que simplifica el hosting de aplicaciones con CI/CD automático."
    },
    "figma": {
      "description": "Herramienta de diseño colaborativo para crear interfaces de usuario y prototipos interactivos profesionales."
    },
    "claude": {
      "description": "Asistente de IA para desarrollo que acelera la programación con sugerencias inteligentes y generación de código."
    }
  },
  "Technologies": {
    "title": "Habilidades Técnicas",
    "description": "Mi experiencia abarca desde el diseño UX/UI hasta la infraestructura, permitiéndome liderar proyectos end-to-end con una visión integral del desarrollo.",
    "techCount": "Tecnologías",
    "yearsExp": "Años de experiencia",
    "additionalInfo": "Mi stack evoluciona constantemente, siempre explorando nuevas herramientas que me permitan crear mejores soluciones y mantenerme al día con las últimas tendencias del desarrollo.",
    "centerText": "Stack Tech",
    "frontend": {
      "title": "Frontend",
      "description": "Interfaces modernas y responsivas con React, Vue, Next.js para experiencias de usuario excepcionales."
    },
    "backend": {
      "title": "Backend",
      "description": "APIs robustas y escalables usando Laravel, FastAPI, Python para sistemas empresariales sólidos."
    },
    "mobile": {
      "title": "Mobile",
      "description": "Desarrollo nativo con Kotlin, Swift y multiplataforma con tecnologías web para aplicaciones móviles performantes."
    }
  },
  "ContactSection": {
    "title": "Contáctame",
    "description": "¿Tienes un proyecto en mente o quieres colaborar? Me encantaría escuchar tu idea y ayudarte a convertirla en realidad.",
    "availableTitle": "Disponible para proyectos",
    "availableDescription": "Actualmente acepto nuevos proyectos y colaboraciones. No dudes en contactarme para discutir tu próximo desarrollo."
  },
  "Actions": {
    "downloadCV": "Descargar CV",
    "viewGitHub": "Ver GitHub"
  },
  "CVDialog": {
    "title": "CV no disponible",
    "description": "¡Hola! Mi CV aún no está disponible para descargar, pero muy pronto lo estará. Te invito a regresar pronto para obtenerlo.",
    "actionText": "Entendido",
    "close": "Cerrar"
  }
}